ib2b-documentation/output/services/managespinventory/getNetworkInventory/Exception - Missing Mandatory Attribute/00_getNetworkInventoryRequest.xml

<?xml version="1.0" encoding="UTF-8"?><!--
	@operation getNetworkInventory
	@action queryNetworkInventory
	@sender FLS
	@receiver EPS
	@scenario Query network inventory fails - Missing mandatory attribute
	@name Exception - Query network inventory fails - Missing mandatory attribute
	@description This is a sample request message for the scenario: Query network inventory fails due to a missing mandatory attribute
	@version V1.0
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:dns="http://www.nbnco.com.au/cim/manageSPInventory/v5"
	xmlns:mhe="http://www.nbnco.com.au/cim/common/messageHeader/v3">
	<soapenv:Header>
		<mhe:MessageHeader>
			<activityName>getNetworkInventory</activityName>
			<msgName>ManageSPInventorygetNetworkInventoryRequest</msgName>
			<businessServiceName>ManageSPInventory</businessServiceName>
			<businessServiceVersion>V1.0</businessServiceVersion>
			<msgType>Request</msgType>
			<accessSeekerID>SDP000000000001</accessSeekerID>
			<correlationId>4eef4405-606e-46db-8c5c-af78e2874077</correlationId>
			<security>Placeholder Security</security>
			<priority>6</priority>
			<communicationPattern>RequestReply</communicationPattern>
			<timestamp>2014-08-18T12:00:01Z</timestamp>
			<businessChannel>Fulfilment</businessChannel>
			<HeaderCharacteristicValue>
				<value>FALSE</value>
				<Characteristic>
					<name>Mocked</name>
				</Characteristic>
			</HeaderCharacteristicValue>
		</mhe:MessageHeader>
	</soapenv:Header>
	<soapenv:Body>
		<dns:ManageSPInventoryRequest>
			<SPInventory>
				<interactionDate>2014-08-18T12:00:00.000Z</interactionDate>
				<SPInventoryComprisedOf>
					<ItemInvolvesProduct>
						<!-- Note it is commented out here deliberately to demonstrate a ValidationException -->
						<!-- <type>NSAS</type> -->
					</ItemInvolvesProduct>
					<ReferencesSPInventoryItem>
						<ItemInvolvesResource>
							<ID>123</ID>
							<type>DPC</type>
						</ItemInvolvesResource>
					</ReferencesSPInventoryItem>
				</SPInventoryComprisedOf>
			</SPInventory>
		</dns:ManageSPInventoryRequest>
	</soapenv:Body>
</soapenv:Envelope>